<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Evernote and makes a pkg of it</string>
	<key>Identifier</key>
	<string>com.github.gn-recipes.pkg.Evernote</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
		<key>PKG_ID</key>
		<string>com.evernote.Evernote</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gn-recipes.download.Evernote</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
