<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Google Drive File Stream and builds a pkg.</string>
    <key>Identifier</key>
    <string>com.github.gn-recipes.pkg.GoogleDriveFileStream</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleDriveFileStream</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.gn-recipes.download.GoogleDriveFileStream</string>
    <key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
